blog/2019/07/nixos-md-luks-lvm-setup/index.org
#+TITLE: NixOS Setup and Configuration
#+DESCRIPTION: NixOS setup with RAID, LUKS, and LVM
#+TAGS: GNU/Linux
#+TAGS: nixos
#+TAGS: nix
#+TAGS: md
#+TAGS: luks
#+TAGS: lvm
#+DATE: 2019-07-23
#+SLUG: nixos-md-luks-lvm-setup
#+LINK: arch-dm-crypt-dev-enc https://wiki.archlinux.org/index.php/Dm-crypt/Device_encryption
#+LINK: arch-dm-crypt-prep https://wiki.archlinux.org/index.php/Dm-crypt/Drive_preparation
#+LINK: arch-linux https://www.archlinux.org/
#+LINK: arch-lvm https://wiki.archlinux.org/index.php/LVM
#+LINK: bios https://en.wikipedia.org/wiki/BIOS
#+LINK: cfg.nix.git https://git.devnulllabs.io/cfg.nix.git
#+LINK: docker https://www.docker.com/
#+LINK: fhs http://www.pathname.com/fhs/
#+LINK: fralef-docker-iptables https://fralef.me/docker-and-iptables.html
#+LINK: gentoo https://gentoo.org/
#+LINK: gentoo-lvm https://wiki.gentoo.org/wiki/LVM
#+LINK: glibc https://www.gnu.org/software/libc/
#+LINK: gnu https://www.gnu.org
#+LINK: grub2 https://www.gnu.org/software/grub/
#+LINK: hivestream-gentoo http://www.hivestream.de/gentoo-installation-with-raid-lvm-luks-and-systemd.html
#+LINK: linux https://www.kernel.org/
#+LINK: luks https://gitlab.com/cryptsetup/cryptsetup/blob/master/README.md
#+LINK: lvm https://www.sourceware.org/lvm2/
#+LINK: md http://neil.brown.name/blog/mdadm
#+LINK: moby-nftables-issue https://github.com/moby/moby/issues/26824
#+LINK: nftables https://wiki.nftables.org/wiki-nftables/index.php/Main_Page
#+LINK: nix https://nixos.org/nix/
#+LINK: nix-paper https://www.usenix.org/legacy/events/lisa04/tech/full_papers/dolstra/dolstra.pdf
#+LINK: nixos https://nixos.org/
#+LINK: nixos-manual https://nixos.org/nixos/manual/index.html
#+LINK: nixos-paper https://nixos.org/~eelco/pubs/nixos-icfp2008-final.pdf
#+LINK: nixos-post https://kennyballou.com/blog/2019/07/nixos
#+LINK: stephank-docker-nftables https://stephank.nl/p/2017-06-05-ipv6-on-production-docker.html
#+LINK: uefi https://en.wikipedia.org/wiki/Unified_Extensible_Firmware_Interface
#+LINK: wiki-btrfs https://en.wikipedia.org/wiki/Btrfs
#+LINK: wiki-ext4 https://en.wikipedia.org/wiki/Ext4
#+LINK: wiki-luks https://en.wikipedia.org/wiki/Linux_Unified_Key_Setup
#+LINK: wiki-lvm https://en.wikipedia.org/wiki/Logical_Volume_Manager_%28Linux%29
#+LINK: wiki-md https://en.wikipedia.org/wiki/Mdadm
#+LINK: wiki-raid https://en.wikipedia.org/wiki/RAID
#+LINK: wiki-serpent https://en.wikipedia.org/wiki/Serpent_(cipher)
#+LINK: wiki-twofish https://en.wikipedia.org/wiki/Twofish
#+LINK: wiki-xfs https://en.wikipedia.org/wiki/XFS
#+LINK: wiki-cow https://en.wikipedia.org/wiki/Copy-on-write
#+LINK: wiki-uefi https://en.wikipedia.org/wiki/Unified_Extensible_Firmware_Interface
#+LINK: grub https://www.gnu.org/software/grub/

#+BEGIN_PREVIEW
A brief overview (read instructions) on setting up a new [[nixos][NixOS]] system with [[lvm][LVM]]
on [[luks][LUKS]] on [[md][md]].  We go through drive preparation, basic [[nixos][NixOS]] installation
instructions, and slight modifications to the instructions for installing a new
system from configuration.
#+END_PREVIEW

** NixOS
:PROPERTIES:
:ID:       6711f5a3-0eba-4d89-a292-29002d9a428c
:END:

[[nixos-post][Previously]], we introduced the concepts and ideas behind
[[nixos][NixOS]] and by extension [[nix][nix]], the package manager.  We,
therefore, will not be reiterating the discussion here.

** System Installation and Configuration
:PROPERTIES:
:ID:       a7328df8-359d-4f43-af94-8716722058ca
:END:

Installing [[nixos][NixOS]] is fairly straight forward.  However, that is a
relative term.  My experience is with [[arch-linux][Arch Linux]] and more
recently [[gentoo][Gentoo]], both not known for having forgiving installations.

#+begin_quote
I don't want to replace the [[nixos-manual][manual]], I only want to really
supplement it with the steps where I deviated from its path or add information
for *my* personal configuration/preferences.
#+end_quote

That said, we will focus on disk preparation and partitioning as that is the
most complicated portion of our installation.

We will walk through the installation of two machines, first, will be my
current laptop with two SSD's, second, my main desktop with six hard drives.
Since we are doing two setups, we will also have a chance to do both
[[bios][BIOS]] and [[uefi][UEFI]] partitioning schemes.

#+begin_quote
I am assuming the use of the [[nixos][NixOS]] live-installation medium.
#+end_quote

*** Laptop
:PROPERTIES:
:ID:       2be64326-cc2d-4392-b63e-c37ce5e1ff02
:END:

