blog/2019/07/nixos-md-luks-lvm-setup/index.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2022-06-30 Thu 05:10 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>NixOS Setup and Configuration</title>
<meta name="generator" content="Org mode" />
<meta name="author" content="kb" />
<meta name="description" content="NixOS setup with RAID, LUKS, and LVM"
 />
<meta charset="utf-8">

<meta name="author" content="Kenny Ballou">
<meta name="viewport" content="width=device-width, initial-scale=1, maximum-scale=1">

<title>~kb</title>

<link rel="canonical" href="/" />
<link href="/index.xml" rel="alternate" type="application/rss+xml"
      title="~kb/blog" />

<link rel="stylesheet" href="/css/simple.css" />
<link rel="stylesheet" href="/css/simple.add.css" />
<link rel="stylesheet" href="/css/katex.css" />
<link rel="stylesheet" href="/css/fa-all.css" />
<link rel="shortcut icon" href="/favicon.ico" type="image/x-icon" />
</head>
<body>
<div id="org-div-home-and-up">
 <a accesskey="h" href="https://kennyballou.com/blog"> UP </a>
 |
 <a accesskey="H" href="https://kennyballou.com/"> HOME </a>
</div><header id="" class="status">
<nav>
  <a href="/about.html">
    <i class="fade fas fa-user-circle"></i>
  </a>
  <a href="https://git.sr.ht/~kennyballou/"
     target="_blank"
     rel="noopener noreferrer">
    <i class="fade fas fa-code-branch fa-1x"></i>
  </a>
  <a href="https://github.com/kennyballou"
     target="_blank"
     rel="noopener noreferrer">
    <i class="fade fab fa-github fa-1x"></i>
  </a>
  <a href="https://bitbucket.org/kballou"
     target="_blank"
     rel="noopener noreferrer">
    <i class="fade fab fa-bitbucket fa-1x"></i>
  </a>
  <a href="https://linkedin.com/in/kennyballou"
     target="_blank"
     rel="noopener noreferrer">
    <i class="fade fab fa-linkedin-in fa-1x"></i>
  </a>
  <a href="https://www.buymeacoffee.com/kennyballou"
     target="_blank"
     rel="noopener noreferrer">
    <i class="fade fas fa-mug-hot fa-1x"></i>
  </a>
  <a href="/resume.pdf"
     target="_blank">
    <i class="fade far fa-file-pdf"></i>
  </a>
  <a href="/B74CC4B41148C3DB364BC21182D94B35744E1B34.asc"
     target="_blank">
    <i class="fade fas fa-key"></i>
  </a>
  <a href="/index.xml" rel="alternate"
     type="application/rss+xml">
    <i class="fade fas fa-rss fa-1x"></i>
  </a>
</nav>
</header>
<div id="main">
<h1 class="title">NixOS Setup and Configuration</h1>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#orgcdf3067">NixOS</a></li>
<li><a href="#org3e6a169">System Installation and Configuration</a>
<ul>
<li><a href="#org6c1d854">Laptop</a>
<ul>
<li><a href="#orgfaf7380">Disk Preparation</a></li>
</ul>
</li>
<li><a href="#org7c9ff29">Desktop</a>
<ul>
<li><a href="#orgf5f6d4e">Disk Preparation</a></li>
</ul>
</li>
<li><a href="#org9ee80b1">NixOS Configuration and Installation</a>
<ul>
<li><a href="#org7b82546">UEFI Notes</a></li>
<li><a href="#org69804f3">Docker, <code>nftables</code>, and NixOS Notes</a></li>
</ul>
</li>
</ul>
</li>
</ul>
</div>
</div>
<div class="PREVIEW">
<p>
A brief overview (read instructions) on setting up a new <a href="https://nixos.org/">NixOS</a> system with <a href="https://www.sourceware.org/lvm2/">LVM</a>
on <a href="https://gitlab.com/cryptsetup/cryptsetup/blob/master/README.md">LUKS</a> on <a href="http://neil.brown.name/blog/mdadm">md</a>.  We go through drive preparation, basic <a href="https://nixos.org/">NixOS</a> installation
instructions, and slight modifications to the instructions for installing a new
system from configuration.
</p>

</div>

<div id="outline-container-orgcdf3067" class="outline-2">
<h2 id="orgcdf3067"><a id="ID-6711f5a3-0eba-4d89-a292-29002d9a428c"></a>NixOS</h2>
<div class="outline-text-2" id="text-orgcdf3067">
<p>
<a href="https://kennyballou.com/blog/2019/07/nixos">Previously</a>, we introduced the concepts and ideas behind
<a href="https://nixos.org/">NixOS</a> and by extension <a href="https://nixos.org/nix/">nix</a>, the package manager.  We,
therefore, will not be reiterating the discussion here.
</p>
</div>
</div>

<div id="outline-container-org3e6a169" class="outline-2">
<h2 id="org3e6a169"><a id="ID-a7328df8-359d-4f43-af94-8716722058ca"></a>System Installation and Configuration</h2>
<div class="outline-text-2" id="text-org3e6a169">
<p>
Installing <a href="https://nixos.org/">NixOS</a> is fairly straight forward.  However, that is a
relative term.  My experience is with <a href="https://www.archlinux.org/">Arch Linux</a> and more
recently <a href="https://gentoo.org/">Gentoo</a>, both not known for having forgiving installations.
</p>

<blockquote>
<p>
I don't want to replace the <a href="https://nixos.org/nixos/manual/index.html">manual</a>, I only want to really
supplement it with the steps where I deviated from its path or add information
for <b>my</b> personal configuration/preferences.
</p>
</blockquote>

<p>
That said, we will focus on disk preparation and partitioning as that is the
most complicated portion of our installation.
</p>

<p>
We will walk through the installation of two machines, first, will be my
current laptop with two SSD's, second, my main desktop with six hard drives.
Since we are doing two setups, we will also have a chance to do both
<a href="https://en.wikipedia.org/wiki/BIOS">BIOS</a> and <a href="https://en.wikipedia.org/wiki/Unified_Extensible_Firmware_Interface">UEFI</a> partitioning schemes.
</p>

<blockquote>
<p>
I am assuming the use of the <a href="https://nixos.org/">NixOS</a> live-installation medium.
</p>
</blockquote>
</div>
