blog/2019/07/nixos-md-luks-lvm-setup/index.org
**** Disk Preparation
:PROPERTIES:
:ID:       5444b570-0867-40ee-bc7e-ba71f4e9bd6a
:END:

#+begin_quote
I am assuming the use of the [[nixos][NixOS]] live installation medium.
#+end_quote

Since this will be an encrypted everything (sans ~/boot~), we will need to
securely erase all the drives.

For each drive, ~${device}~, perform the following:

#+begin_quote
Lines beginning with ~#~ are commands to be executed as the ~root~ user.
#+end_quote

#+begin_example
# cryptsetup open --type plain --key-file=/dev/urandom ${device} wipe-me
# dd if=/dev/zero of=/dev/mapper/wipe-me status=progress
# cryptsetup close
#+end_example

#+begin_quote
For large hard drives, this step can take a considerable amount of time.  This
can be done in parallel by using different identifiers than ~wipe-me~.

This probably *cannot* be parallelized if using the more paranoid random source
~/dev/random~ device instead of ~/dev/urandom~ as there will likely not be
enough entropy for more than one device.
#+end_quote

Concretely, this may look like:

#+begin_example
# cryptsetup open --type plain --key-file=/dev/urandom /dev/sda wipe-me
# dd if=/dev/zero of=/dev/mapper/wipe-me status=progress
# cryptsetup close
#+end_example

After securely erasing each hard drive to be used, we will next setup the
various partitions for each drive.  Since we will be using [[lvm][~LVM~]] on a
[[luks][~LUKS~]] container, residing on a [[wiki-raid][RAID 1]] pair of hard
drives, our partitioning scheme will be pretty simple.

Since [[nixos][NixOS]], by default, uses [[grub2][Grub2]], we will need to
create a 2 MB first partition for [[bios][BIOS]] systems.

After partitioning the disk, the partition table should look similar to the
following:

#+begin_example
Device       Start        End    Sectors  Size Type
/dev/sda1     2048       6143       4096    2M BIOS boot
/dev/sda2     6144    1054719    1048576  512M Linux filesystem
/dev/sda3  1054720 1953525134 1952470415  931G Linux RAID
#+end_example

Perform or replicate the partition table to the second disk.  After which, we
will begin the configuration of the mirror.

#+begin_quote
Certainly, it's possible to securely erase one disk, partition it, then copy it
to the other disk via ~dd if=/dev/sda of=/dev/sdb status=progress~.
#+end_quote

We will create two mirrors for this configuration, one for the ~/boot~
partition and another for the [[luks][~LUKS~]] container:

#+begin_example
# mdadm --create /dev/md1 --level=mirror --raid-devices=2 /dev/sda2 /dev/sdb2
# mdadm --create /dev/md2 --level=mirror --raid-devices=2 /dev/sda3 /dev/sdb3
#+end_example

After creating the mirrors, we need to create the [[luks][~LUKS~]] container
and the format the ~/boot~ partition.

Boot Partition:

#+begin_example
# mkfs.ext4 -L boot /dev/md1
#+end_example

[[luks][~LUKS~]] Container:

#+begin_quote
When configuring encrypted containers, there are lot of different options and
parameters to choose from.  For example, there are various cryptography schemes
and modes to choose from.  ~AES-XTS-PLAIN64~ is a solid choice since most CPU's
will have extensions for doing ~AES~, increasing the throughput.  I personally,
have been looking into the other ~AES~ finalists such as
[[wiki-twofish][Twofish]] and [[wiki-serpent][Serpent]].
#+end_quote

#+begin_example
# cryptsetup -v \
             --type luks \
             --cipher twofish-xts-plain64 \
             --key-size 512 \
             --hash sha512 \
             --iter-time 5000 \
             --use-random \
             --verify-passphrase \
             luksFormat \
             /dev/md2
#+end_example

Once the [[luks][~LUKS~]] container is created, open it:

#+begin_example
# cryptsetup open /dev/md2 cryptroot
#+end_example

Now, we can begin creating the [[lvm][~LVM~]] volumes:

#+begin_example
# pvcreate /dev/mapper/cryptroot
# vgcreate vg0 /dev/mapper/cryptroot
# lvcreate -L 1G vg0 -n root
# lvcreate -L 10G vg0 -n var
# lvcreate -L 20G vg0 -n opt
# lvcreate -L 32G vg0 -n swap
# lvcreate -L 100G vg0 -n nix
# lvcreate -L 100G vg0 -n home
# lvcreate -L 100G vg0 -n docker
#+end_example

Notice, there is no ~/usr~ in our [[lvm][~LVM~]] configuration.  Furthermore,
notice ~/~ is particularly small.  [[nixos][NixOS]] is particularly different
when it comes [[fhs][Filesystem Hierarchy]].  Notably, there is a large portion
of the volume set aside for ~/nix~.  The majority of the "system" will be in
this directory.

Now we need to format the volumes:

#+begin_example
# mkfs.ext4 -L root /dev/mapper/vg0-root
# mkfs.ext4 -L var /dev/mapper/vg0-var
# mkfs.ext4 -L opt /dev/mapper/vg0-opt
# mkswap /dev/mapper/vg0-swap
# mkfs.xfs -L nix /dev/mapper/vg0-nix
# mkfs.xfs -L home /dev/mapper/vg0-home
# mkfs.btrfs -L docker /dev/mapper/vg0-docker
#+end_example

Most volumes will be formatted with the [[wiki-ext4][~ext4~ filesystem]],
typical for standard [[gnu][GNU]]/[[linux][Linux]] systems.  However, we will
use [[wiki-xfs][~XFS~]] for ~/nix~ and ~/home~.  [[wiki-xfs][~XFS~]] is
particularly well suited for purposes of these directories.  Furthermore, since
[[docker][~Docker~]] is an (unfortunate) necessity, creating a proper
[[wiki-cow][COW]] filesystem using [[wiki-btrfs][~Btrfs~]], we get better
management of [[docker][Docker]] images.

Next, we will mount these volumes into various folders to begin the
installation, creating the folder trees as necessary to mount:

#+begin_example
# mount /dev/mapper/vg0-root /mnt/
# mkdir -p /mnt/{var,nix,home,boot,opt}
# mount /dev/md1 /mnt/boot
# mount /dev/mapper/vg0-opt /mnt/opt
# mount /dev/mapper/vg0-var /mnt/var
# mount /dev/mapper/vg0-home /mnt/home
# mount /dev/mapper/vg0-nix /mnt/nix
# mkdir -p /mnt/var/lib/docker
# mount /dev/mapper/vg0-docker /mnt/var/lib/docker
#+end_example

*** Desktop
:PROPERTIES:
:ID:       6a12e718-4c78-4070-b084-508dee37644a
:END:

The desktop preparation and configuration are very similar to the laptop.
However, as noted above, the complication comes from the fact that instead of a
single pair of drives, we will have 3 pairs of drives.  Everything else is
essentially the same.

