blog/2019/07/nixos-md-luks-lvm-setup/index.html

<div id="outline-container-org6c1d854" class="outline-3">
<h3 id="org6c1d854"><a id="ID-2be64326-cc2d-4392-b63e-c37ce5e1ff02"></a>Laptop</h3>
<div class="outline-text-3" id="text-org6c1d854">
</div>

<div id="outline-container-orgfaf7380" class="outline-4">
<h4 id="orgfaf7380"><a id="ID-5444b570-0867-40ee-bc7e-ba71f4e9bd6a"></a>Disk Preparation</h4>
<div class="outline-text-4" id="text-orgfaf7380">
<blockquote>
<p>
I am assuming the use of the <a href="https://nixos.org/">NixOS</a> live installation medium.
</p>
</blockquote>

<p>
Since this will be an encrypted everything (sans <code>/boot</code>), we will need to
securely erase all the drives.
</p>

<p>
For each drive, <code>${device}</code>, perform the following:
</p>

<blockquote>
<p>
Lines beginning with <code>#</code> are commands to be executed as the <code>root</code> user.
</p>
</blockquote>

<pre class="example">
# cryptsetup open --type plain --key-file=/dev/urandom ${device} wipe-me
# dd if=/dev/zero of=/dev/mapper/wipe-me status=progress
# cryptsetup close
</pre>

<blockquote>
<p>
For large hard drives, this step can take a considerable amount of time.  This
can be done in parallel by using different identifiers than <code>wipe-me</code>.
</p>

<p>
This probably <b>cannot</b> be parallelized if using the more paranoid random source
<code>/dev/random</code> device instead of <code>/dev/urandom</code> as there will likely not be
enough entropy for more than one device.
</p>
</blockquote>

<p>
Concretely, this may look like:
</p>

<pre class="example">
# cryptsetup open --type plain --key-file=/dev/urandom /dev/sda wipe-me
# dd if=/dev/zero of=/dev/mapper/wipe-me status=progress
# cryptsetup close
</pre>

<p>
After securely erasing each hard drive to be used, we will next setup the
various partitions for each drive.  Since we will be using <a href="https://www.sourceware.org/lvm2/"><code>LVM</code></a> on a
<a href="https://gitlab.com/cryptsetup/cryptsetup/blob/master/README.md"><code>LUKS</code></a> container, residing on a <a href="https://en.wikipedia.org/wiki/RAID">RAID 1</a> pair of hard
drives, our partitioning scheme will be pretty simple.
</p>

<p>
Since <a href="https://nixos.org/">NixOS</a>, by default, uses <a href="https://www.gnu.org/software/grub/">Grub2</a>, we will need to
create a 2 MB first partition for <a href="https://en.wikipedia.org/wiki/BIOS">BIOS</a> systems.
</p>

<p>
After partitioning the disk, the partition table should look similar to the
following:
</p>

<pre class="example">
Device       Start        End    Sectors  Size Type
/dev/sda1     2048       6143       4096    2M BIOS boot
/dev/sda2     6144    1054719    1048576  512M Linux filesystem
/dev/sda3  1054720 1953525134 1952470415  931G Linux RAID
</pre>

<p>
Perform or replicate the partition table to the second disk.  After which, we
will begin the configuration of the mirror.
</p>

<blockquote>
<p>
Certainly, it's possible to securely erase one disk, partition it, then copy it
to the other disk via <code>dd if=/dev/sda of=/dev/sdb status=progress</code>.
</p>
</blockquote>

<p>
We will create two mirrors for this configuration, one for the <code>/boot</code>
partition and another for the <a href="https://gitlab.com/cryptsetup/cryptsetup/blob/master/README.md"><code>LUKS</code></a> container:
</p>

<pre class="example">
# mdadm --create /dev/md1 --level=mirror --raid-devices=2 /dev/sda2 /dev/sdb2
# mdadm --create /dev/md2 --level=mirror --raid-devices=2 /dev/sda3 /dev/sdb3
</pre>

<p>
After creating the mirrors, we need to create the <a href="https://gitlab.com/cryptsetup/cryptsetup/blob/master/README.md"><code>LUKS</code></a> container
and the format the <code>/boot</code> partition.
</p>

<p>
Boot Partition:
</p>

<pre class="example">
# mkfs.ext4 -L boot /dev/md1
</pre>

<p>
<a href="https://gitlab.com/cryptsetup/cryptsetup/blob/master/README.md"><code>LUKS</code></a> Container:
</p>

<blockquote>
<p>
When configuring encrypted containers, there are lot of different options and
parameters to choose from.  For example, there are various cryptography schemes
and modes to choose from.  <code>AES-XTS-PLAIN64</code> is a solid choice since most CPU's
will have extensions for doing <code>AES</code>, increasing the throughput.  I personally,
have been looking into the other <code>AES</code> finalists such as
<a href="https://en.wikipedia.org/wiki/Twofish">Twofish</a> and <a href="https://en.wikipedia.org/wiki/Serpent_(cipher)">Serpent</a>.
</p>
</blockquote>

<pre class="example">
# cryptsetup -v \
             --type luks \
             --cipher twofish-xts-plain64 \
             --key-size 512 \
             --hash sha512 \
             --iter-time 5000 \
             --use-random \
             --verify-passphrase \
             luksFormat \
             /dev/md2
</pre>

<p>
Once the <a href="https://gitlab.com/cryptsetup/cryptsetup/blob/master/README.md"><code>LUKS</code></a> container is created, open it:
</p>

<pre class="example">
# cryptsetup open /dev/md2 cryptroot
</pre>

<p>
Now, we can begin creating the <a href="https://www.sourceware.org/lvm2/"><code>LVM</code></a> volumes:
</p>

<pre class="example">
# pvcreate /dev/mapper/cryptroot
# vgcreate vg0 /dev/mapper/cryptroot
# lvcreate -L 1G vg0 -n root
# lvcreate -L 10G vg0 -n var
# lvcreate -L 20G vg0 -n opt
# lvcreate -L 32G vg0 -n swap
# lvcreate -L 100G vg0 -n nix
# lvcreate -L 100G vg0 -n home
# lvcreate -L 100G vg0 -n docker
</pre>

<p>
Notice, there is no <code>/usr</code> in our <a href="https://www.sourceware.org/lvm2/"><code>LVM</code></a> configuration.  Furthermore,
notice <code>/</code> is particularly small.  <a href="https://nixos.org/">NixOS</a> is particularly different
when it comes <a href="http://www.pathname.com/fhs/">Filesystem Hierarchy</a>.  Notably, there is a large portion
of the volume set aside for <code>/nix</code>.  The majority of the "system" will be in
this directory.
</p>

<p>
Now we need to format the volumes:
</p>

<pre class="example">
# mkfs.ext4 -L root /dev/mapper/vg0-root
# mkfs.ext4 -L var /dev/mapper/vg0-var
# mkfs.ext4 -L opt /dev/mapper/vg0-opt
# mkswap /dev/mapper/vg0-swap
# mkfs.xfs -L nix /dev/mapper/vg0-nix
# mkfs.xfs -L home /dev/mapper/vg0-home
# mkfs.btrfs -L docker /dev/mapper/vg0-docker
</pre>

<p>
Most volumes will be formatted with the <a href="https://en.wikipedia.org/wiki/Ext4"><code>ext4</code> filesystem</a>,
typical for standard <a href="https://www.gnu.org">GNU</a>/<a href="https://www.kernel.org/">Linux</a> systems.  However, we will
use <a href="https://en.wikipedia.org/wiki/XFS"><code>XFS</code></a> for <code>/nix</code> and <code>/home</code>.  <a href="https://en.wikipedia.org/wiki/XFS"><code>XFS</code></a> is
particularly well suited for purposes of these directories.  Furthermore, since
<a href="https://www.docker.com/"><code>Docker</code></a> is an (unfortunate) necessity, creating a proper
<a href="https://en.wikipedia.org/wiki/Copy-on-write">COW</a> filesystem using <a href="https://en.wikipedia.org/wiki/Btrfs"><code>Btrfs</code></a>, we get better
management of <a href="https://www.docker.com/">Docker</a> images.
</p>

<p>
Next, we will mount these volumes into various folders to begin the
installation, creating the folder trees as necessary to mount:
</p>

<pre class="example">
# mount /dev/mapper/vg0-root /mnt/
# mkdir -p /mnt/{var,nix,home,boot,opt}
# mount /dev/md1 /mnt/boot
# mount /dev/mapper/vg0-opt /mnt/opt
# mount /dev/mapper/vg0-var /mnt/var
# mount /dev/mapper/vg0-home /mnt/home
# mount /dev/mapper/vg0-nix /mnt/nix
# mkdir -p /mnt/var/lib/docker
# mount /dev/mapper/vg0-docker /mnt/var/lib/docker
</pre>
</div>
</div>
</div>

<div id="outline-container-org7c9ff29" class="outline-3">
<h3 id="org7c9ff29"><a id="ID-6a12e718-4c78-4070-b084-508dee37644a"></a>Desktop</h3>
<div class="outline-text-3" id="text-org7c9ff29">
<p>
The desktop preparation and configuration are very similar to the laptop.
However, as noted above, the complication comes from the fact that instead of a
single pair of drives, we will have 3 pairs of drives.  Everything else is
essentially the same.
</p>
</div>
