blog/2019/07/nixos-md-luks-lvm-setup/index.org
**** Disk Preparation
:PROPERTIES:
:ID:       7655a364-79cc-4fd3-b866-b58a93b16a15
:END:

We first start by securely erasing all the devices:

#+begin_example
# cryptsetup open --type plain --key-file /dev/urandom /dev/nvme0n1 wipe-me
# dd if=/dev/zero of=/dev/mapper/wipe-me
# cryptsetup close wipe-me
#+end_example

#+begin_quote
Remember, we don't _have_ to securely erase _every_ device since we will be
mirroring several of them together.  This does require that each drive are
*identical*.  If they are not identical, it is likely safer to erase every
drive.
#+end_quote

Next, we will begin by partitioning each of the devices:

#+begin_example
# gdisk /dev/nvme0n1
Command (? for help): n
Partition number (1-128, default 1): 1
First sector:
Last sector: +512M
Hex code or GUID: EF00
Command (? for help): n
First sector: 
Last sector: 
Hex code or GUID: FD00
Command (? for help): w
#+end_example

This will create the boot ~EFI~ system partition and the first encrypted
container partition.

We do essentially the same thing for each of the pairs.  However, the next two
only need a single partition for the [[md][~md~]] container.

Unlike the secure erasing above, we _do_ need to create the partition tables
for *each* device.

After partitioning the drives, we will construct the [[wiki-raid][mirrors]]:

#+begin_example
# mdadm --create /dev/md1 --level=mirror --raid-devices=2 --metadata 1.0 /dev/nvme0n1p1 /dev/nvme1n1p1
# mdadm --create /dev/md2 --level=mirror --raid-devices=2 /dev/nvme0n1p2 /dev/nvme1n1p2
# mdadm --create /dev/md3 --level=mirror --raid-devices=2 /dev/sda1 /dev/sdb1
# mdadm --create /dev/md4 --level=mirror --raid-devices=2 /dev/sdd1 /dev/sde1
#+end_example

We need to create the ~/boot~ mirror with ~metadata 1.0~ so that the super blocks
are put at the end of the RAID such that the ~UEFI~ does not get confused when
attempting to boot the system.  Otherwise, we use the default for all other
mirrors.

To monitor the progress of the mirror synchronization, use the following
command:

#+begin_example
# watch cat /proc/mdstat
#+end_example

It's not vitally important that the mirrors are synchronized before
continuing.  Although, from a reliability perspective, it is "safer".

#+begin_quote
It's also possible to specify the second device as ~missing~ in each of the
above commands.  This way, the synchronization process can effectively be
deferred until the end.
#+end_quote

After creating each of the mirrors, we need to format the ~/boot~ ~EFI~ system
partition.  This is a ~UEFI~ system, therefore, we will be using ~vfat~ for the
filesystem.

#+begin_example
# mkfs.vfat -n boot /dev/md1
#+end_example

Now, we must create the various [[luks][~LUKS~]] containers:

#+begin_example
# cryptsetup -v \
             --type luks \
             --cipher twofish-xts-plain64 \
             --key-size 512 \
             --hash sha512 \
             --iter-time 5000 \
             --use-random \
             --verify-passphrase \
             luksFormat \
             /dev/md2
# cryptsetup -v \
             --type luks \
             --cipher twofish-xts-plain64 \
             --key-size 512 \
             --hash sha512 \
             --iter-time 5000 \
             --use-random \
             --verify-passphrase \
             luksFormat \
             /dev/md3
# cryptsetup -v \
             --type luks \
             --cipher twofish-xts-plain64 \
             --key-size 512 \
             --hash sha512 \
             --iter-time 5000 \
             --use-random \
             --verify-passphrase \
             luksFormat \
             /dev/md4
#+end_example

Next, we will open and start creating our [[lvm][~LVM~]] volumes:

#+begin_example
# cryptsetup open /dev/md2 cvg0
# cryptsetup open /dev/md3 cvg1
# cryptsetup open /dev/md4 cvg2
#+end_example

Now the [[lvm][~LVM~]] setup:

#+begin_example
# pvcreate /dev/mapper/cvg0
# vgcreate vg0 /dev/mapper/cvg0
# pvcreate /dev/mapper/cvg1
# vgcreate vg1 /dev/mapper/cvg1
# pvcreate /dev/mapper/cvg2
# vgcreate vg2 /dev/mapper/cvg2
#+end_example

Now that the volume groups are created, we will start creating the actual
logical volumes:

#+begin_example
# lvcreate -L 1G -n root vg0
# lvcreate -L 100G -n nix vg0
# lvcreate -L 15G -n opt vg0
# lvcreate -L 20G -n var vg1
# lvcreate -L 100G -n docker vg1
# lvcreate -L 64G -n swap vg1
# lvcreate -L 1T -n home vg2
#+end_example

Finally, we can format each of the partitions:

#+begin_example
# mkfs.ext4 -L root /dev/mapper/vg0-root
# mkfs.ext4 -L opt /dev/mapper/vg0-opt
# mkfs.xfs -L nix /dev/mapper/vg0-nix
# mkfs.ext4 -L var /dev/mapper/vg1-var
# mkfs.btrfs -L docker /dev/mapper/vg1-docker
# mkfs.xfs -L home /dev/mapper/vg2-home
# mkswap /dev/mapper/vg1-swap
#+end_example

Before moving onto the next step, we first need to mount each of volumes in the
desired path:

#+begin_example
# mount /dev/mapper/vg0-root /mnt
# mkdir -p /mnt/{boot,home,nix,var,opt}
# mount /dev/md1 /mnt/boot
# mount /dev/mapper/vg0-nix /mnt/nix
# mount /dev/mapper/vg0-opt /mnt/opt
# mount /dev/mapper/vg1-var /mnt/var
# mkdir -p /mnt/var/lib/docker
# mount /dev/mapper/vg1-docker /mnt/docker
# mount /dev/mapper/vg2-home /mnt/home
#+end_example

*** NixOS Configuration and Installation
:PROPERTIES:
:ID:       33ac70a7-24ba-49bf-8f13-f957ca9e9179
:END:

Once the disk preparation is complete, we can follow the steps from the
[[nixos-manual][NixOS Manual]] to create the initial configuration:

#+begin_example
# nixos-generate-config --root /mnt
#+end_example

After this is done, we can move onto configuring the system the way we want.
However, this is where we will deviate slightly from the manual.  First, we
will need to install ~git~ so we can pull down our configuration.

#+begin_quote
The following steps are very personal.  You're free to use my
[[cfg.nix.git][configuration]] if you do not have your own, or if you would
like to try it out.  However, you will likely want different things from _your_
system.  Change the following steps as necessary.
#+end_quote

#+begin_example
# nix-env -i git
# cd /mnt/etc/
# mv nixos nixos.bak
# git clone git://git.devnulllabs.io/cfg.nix.git nixos
# cd nixos
# cp ../nixos.bak/hardware-configuration.nix .
#+end_example

My set of [[nix][Nix]] [[cfg.nix.git][configuration]] includes subfolders for
each machine.  To setup a new machine, I soft link ("symlink") the machine's
~configuration.nix~ into the ~[/mnt]/etc/nixos~ folder.  If this is a new
machine or a rebuild, I typically merge the differences between the
~hardware-configuration.nix~ files.  After which, I perform the regular
installation.

#+begin_example
nixos-install --no-root-passwd
#+end_example

Once this finishes, the installation and configuration is done.  Reboot the
machine, remove the installation/live media, use the freshly installed machine
as if it was always there.

