blog/2019/07/nixos-md-luks-lvm-setup/index.html

<div id="outline-container-orgf5f6d4e" class="outline-4">
<h4 id="orgf5f6d4e"><a id="ID-7655a364-79cc-4fd3-b866-b58a93b16a15"></a>Disk Preparation</h4>
<div class="outline-text-4" id="text-orgf5f6d4e">
<p>
We first start by securely erasing all the devices:
</p>

<pre class="example">
# cryptsetup open --type plain --key-file /dev/urandom /dev/nvme0n1 wipe-me
# dd if=/dev/zero of=/dev/mapper/wipe-me
# cryptsetup close wipe-me
</pre>

<blockquote>
<p>
Remember, we don't <span class="underline">have</span> to securely erase <span class="underline">every</span> device since we will be
mirroring several of them together.  This does require that each drive are
<b>identical</b>.  If they are not identical, it is likely safer to erase every
drive.
</p>
</blockquote>

<p>
Next, we will begin by partitioning each of the devices:
</p>

<pre class="example">
# gdisk /dev/nvme0n1
Command (? for help): n
Partition number (1-128, default 1): 1
First sector:
Last sector: +512M
Hex code or GUID: EF00
Command (? for help): n
First sector: 
Last sector: 
Hex code or GUID: FD00
Command (? for help): w
</pre>

<p>
This will create the boot <code>EFI</code> system partition and the first encrypted
container partition.
</p>

<p>
We do essentially the same thing for each of the pairs.  However, the next two
only need a single partition for the <a href="http://neil.brown.name/blog/mdadm"><code>md</code></a> container.
</p>

<p>
Unlike the secure erasing above, we <span class="underline">do</span> need to create the partition tables
for <b>each</b> device.
</p>

<p>
After partitioning the drives, we will construct the <a href="https://en.wikipedia.org/wiki/RAID">mirrors</a>:
</p>

<pre class="example">
# mdadm --create /dev/md1 --level=mirror --raid-devices=2 --metadata 1.0 /dev/nvme0n1p1 /dev/nvme1n1p1
# mdadm --create /dev/md2 --level=mirror --raid-devices=2 /dev/nvme0n1p2 /dev/nvme1n1p2
# mdadm --create /dev/md3 --level=mirror --raid-devices=2 /dev/sda1 /dev/sdb1
# mdadm --create /dev/md4 --level=mirror --raid-devices=2 /dev/sdd1 /dev/sde1
</pre>

<p>
We need to create the <code>/boot</code> mirror with <code>metadata 1.0</code> so that the super blocks
are put at the end of the RAID such that the <code>UEFI</code> does not get confused when
attempting to boot the system.  Otherwise, we use the default for all other
mirrors.
</p>

<p>
To monitor the progress of the mirror synchronization, use the following
command:
</p>

<pre class="example">
# watch cat /proc/mdstat
</pre>

<p>
It's not vitally important that the mirrors are synchronized before
continuing.  Although, from a reliability perspective, it is "safer".
</p>

<blockquote>
<p>
It's also possible to specify the second device as <code>missing</code> in each of the
above commands.  This way, the synchronization process can effectively be
deferred until the end.
</p>
</blockquote>

<p>
After creating each of the mirrors, we need to format the <code>/boot</code> <code>EFI</code> system
partition.  This is a <code>UEFI</code> system, therefore, we will be using <code>vfat</code> for the
filesystem.
</p>

<pre class="example">
# mkfs.vfat -n boot /dev/md1
</pre>

<p>
Now, we must create the various <a href="https://gitlab.com/cryptsetup/cryptsetup/blob/master/README.md"><code>LUKS</code></a> containers:
</p>

<pre class="example">
# cryptsetup -v \
             --type luks \
             --cipher twofish-xts-plain64 \
             --key-size 512 \
             --hash sha512 \
             --iter-time 5000 \
             --use-random \
             --verify-passphrase \
             luksFormat \
             /dev/md2
# cryptsetup -v \
             --type luks \
             --cipher twofish-xts-plain64 \
             --key-size 512 \
             --hash sha512 \
             --iter-time 5000 \
             --use-random \
             --verify-passphrase \
             luksFormat \
             /dev/md3
# cryptsetup -v \
             --type luks \
             --cipher twofish-xts-plain64 \
             --key-size 512 \
             --hash sha512 \
             --iter-time 5000 \
             --use-random \
             --verify-passphrase \
             luksFormat \
             /dev/md4
</pre>

<p>
Next, we will open and start creating our <a href="https://www.sourceware.org/lvm2/"><code>LVM</code></a> volumes:
</p>

<pre class="example">
# cryptsetup open /dev/md2 cvg0
# cryptsetup open /dev/md3 cvg1
# cryptsetup open /dev/md4 cvg2
</pre>

<p>
Now the <a href="https://www.sourceware.org/lvm2/"><code>LVM</code></a> setup:
</p>

<pre class="example">
# pvcreate /dev/mapper/cvg0
# vgcreate vg0 /dev/mapper/cvg0
# pvcreate /dev/mapper/cvg1
# vgcreate vg1 /dev/mapper/cvg1
# pvcreate /dev/mapper/cvg2
# vgcreate vg2 /dev/mapper/cvg2
</pre>

<p>
Now that the volume groups are created, we will start creating the actual
logical volumes:
</p>

<pre class="example">
# lvcreate -L 1G -n root vg0
# lvcreate -L 100G -n nix vg0
# lvcreate -L 15G -n opt vg0
# lvcreate -L 20G -n var vg1
# lvcreate -L 100G -n docker vg1
# lvcreate -L 64G -n swap vg1
# lvcreate -L 1T -n home vg2
</pre>

<p>
Finally, we can format each of the partitions:
</p>

<pre class="example">
# mkfs.ext4 -L root /dev/mapper/vg0-root
# mkfs.ext4 -L opt /dev/mapper/vg0-opt
# mkfs.xfs -L nix /dev/mapper/vg0-nix
# mkfs.ext4 -L var /dev/mapper/vg1-var
# mkfs.btrfs -L docker /dev/mapper/vg1-docker
# mkfs.xfs -L home /dev/mapper/vg2-home
# mkswap /dev/mapper/vg1-swap
</pre>

<p>
Before moving onto the next step, we first need to mount each of volumes in the
desired path:
</p>

<pre class="example">
# mount /dev/mapper/vg0-root /mnt
# mkdir -p /mnt/{boot,home,nix,var,opt}
# mount /dev/md1 /mnt/boot
# mount /dev/mapper/vg0-nix /mnt/nix
# mount /dev/mapper/vg0-opt /mnt/opt
# mount /dev/mapper/vg1-var /mnt/var
# mkdir -p /mnt/var/lib/docker
# mount /dev/mapper/vg1-docker /mnt/docker
# mount /dev/mapper/vg2-home /mnt/home
</pre>
</div>
</div>
</div>

<div id="outline-container-org9ee80b1" class="outline-3">
<h3 id="org9ee80b1"><a id="ID-33ac70a7-24ba-49bf-8f13-f957ca9e9179"></a>NixOS Configuration and Installation</h3>
<div class="outline-text-3" id="text-org9ee80b1">
<p>
Once the disk preparation is complete, we can follow the steps from the
<a href="https://nixos.org/nixos/manual/index.html">NixOS Manual</a> to create the initial configuration:
</p>

<pre class="example">
# nixos-generate-config --root /mnt
</pre>

<p>
After this is done, we can move onto configuring the system the way we want.
However, this is where we will deviate slightly from the manual.  First, we
will need to install <code>git</code> so we can pull down our configuration.
</p>

<blockquote>
<p>
The following steps are very personal.  You're free to use my
<a href="https://git.devnulllabs.io/cfg.nix.git">configuration</a> if you do not have your own, or if you would
like to try it out.  However, you will likely want different things from <span class="underline">your</span>
system.  Change the following steps as necessary.
</p>
</blockquote>

<pre class="example">
# nix-env -i git
# cd /mnt/etc/
# mv nixos nixos.bak
# git clone git://git.devnulllabs.io/cfg.nix.git nixos
# cd nixos
# cp ../nixos.bak/hardware-configuration.nix .
</pre>

<p>
My set of <a href="https://nixos.org/nix/">Nix</a> <a href="https://git.devnulllabs.io/cfg.nix.git">configuration</a> includes subfolders for
each machine.  To setup a new machine, I soft link ("symlink") the machine's
<code>configuration.nix</code> into the <code>[/mnt]/etc/nixos</code> folder.  If this is a new
machine or a rebuild, I typically merge the differences between the
<code>hardware-configuration.nix</code> files.  After which, I perform the regular
installation.
</p>

<pre class="example">
nixos-install --no-root-passwd
</pre>

<p>
Once this finishes, the installation and configuration is done.  Reboot the
machine, remove the installation/live media, use the freshly installed machine
as if it was always there.
</p>
</div>
