blog/2019/07/nixos-md-luks-lvm-setup/index.org
**** UEFI Notes
:PROPERTIES:
:ID:       c71414c6-6ccd-45c6-809d-f0c53d06aed7
:END:

Aside from learning about the ~mdadm~ metadata placement being an issue for
[[wiki-uefi][UEFI]] systems to boot, I also had played around with the various
settings for [[grub][GRUB]] to install correctly without errors and warnings.

Here's the full [[grub][GRUB]] configuration:

#+begin_src nix
boot.loader.systemd-boot = {
  enable = true;
  editor = false;
};
boot.loader.efi = {
  canTouchEfiVariables = false;
};
boot.loader.grub = {
  enable = true;
  copyKernels = true;
  efiInstallAsRemovable = true;
  efiSupport = true;
  fsIdentifier = "uuid";
  splashMode = "stretch";
  version = 2;
  device = "nodev";
  extraEntries = ''
    menuentry "Reboot" {
      reboot
    }
    menuentry "Poweroff" {
      halt
    }
  '';
};
#+end_src

Of particular importance are the following variables:

- ~boot.loader.systemd-boot.enable~

- ~boot.loader.efi.canTouchEfiVariables~

- ~boot.loader.grub.efiInstallAsRemovable~

- ~boot.loader.grub.device~

Ideally, ~boot.loader.grub.efiSupport~ would be sufficient to tell
[[grub][GRUB]] to install the [[wiki-uefi][UEFI]] payload instead.  However, as
it turns out, there is a few more settings required to ensure proper booting in
[[wiki-uefi][UEFI]] environments, particularly when using [[wiki-raid][RAID]].

According to the manual, it's required to set ~boot.loader.systemd-boot.enable~
to ~true~.  Setting ~boot.loader.grub.device~ or ~boot.loader.grub.devices~ to
anything other than ~"nodev"~ or ~[ "nodev" ]~ disables
~boot.loader.grub.efiSupport~.  Moreover, with
~boot.loader.efi.canTouchEfiVariables~, the installation/build process attempts
to run ~efibootmgr~ to modify the NVRAM of the motherboard, setting the boot
targets, this fails when used with ~boot.loader.grub.device = "nodev"~.
Therefore, it is required to set ~boot.loader.efi.canTouchEfiVariables = false~
and ~boot.loader.grub.efiInstallAsRemovable~ such that installation process
simply places the [[grub][GRUB]] [[wiki-uefi][UEFI]] payload in the "default"
search location for the motherboard, consulted before the NVRAM settings.

**** Docker, ~nftables~, and NixOS Notes
:PROPERTIES:
:ID:       46f99075-4013-4f5d-a991-9b07d3e7e564
:END:

In developing the system configuration, I came across some issues with respect
to [[docker][Docker]] and [[nftables][~nftables~]].  The
[[nftables][~nftables~]] project became standard in the [[linux][Linux]] kernel
in version 3.13 and replaces the myriad of existing ~{ip,ip6,arp,eb}_tables~
tools and (kernel) code.  Specifically, any [[linux][Linux]] kernel above 3.13,
~iptables~ and friends are now simply a user-space front-end to the
[[nftables][~nftables~]] kernel backend.  However, [[docker][Docker]] still
does not support [[nftables][~nftables~]] directly; there's an
[[moby-nftables-issue][issue]] from 2016.

With some [[stephank-docker-nftables][digging]] and
[[fralef-docker-iptables][work]], there's a way to get [[nftables][~nftables~]]
and [[docker][Docker]] to work nicely with each other.

Specifically, we configure [[docker][Docker]] to not modify the ~iptables~
rules using the ~--iptables=false~ configuration flag for the daemon.  In this
configuration, we can tightly control the firewall with whatever tool we wish,
in this case, [[nftables][~nftables~]].  This comes with the added benefit of
bound ports are not automatically opened to the world.

However, when using [[nixos][NixOS]], any modification to the
[[nftables][~nftables~]] ruleset will require a reload.  However, with
[[docker][Docker]] loaded as well, this reload process can actually bring down
the firewall completely since [[docker][Docker]] (even with ~--iptables=false~)
will attempt to load the ~iptables~ kernel module, blocking the resulting
~nftables~ module load.  When using a system such as [[gentoo][Gentoo]] this
was never an issue, since the configuration completely ignore the ~iptables~
subsystem (since it was compiled out).  In [[nixos][NixOS]], there's a bit more
dance involved for the time being.

This is really a minor annoyance as the firewall rules are only seldom changed.
