blog/2019/07/nixos-md-luks-lvm-setup/index.html

<div id="outline-container-org7b82546" class="outline-4">
<h4 id="org7b82546"><a id="ID-c71414c6-6ccd-45c6-809d-f0c53d06aed7"></a>UEFI Notes</h4>
<div class="outline-text-4" id="text-org7b82546">
<p>
Aside from learning about the <code>mdadm</code> metadata placement being an issue for
<a href="https://en.wikipedia.org/wiki/Unified_Extensible_Firmware_Interface">UEFI</a> systems to boot, I also had played around with the various
settings for <a href="https://www.gnu.org/software/grub/">GRUB</a> to install correctly without errors and warnings.
</p>

<p>
Here's the full <a href="https://www.gnu.org/software/grub/">GRUB</a> configuration:
</p>

<div class="org-src-container">
<pre class="src src-nix">boot.loader.systemd-boot = {
  enable = true;
  editor = false;
};
boot.loader.efi = {
  canTouchEfiVariables = false;
};
boot.loader.grub = {
  enable = true;
  copyKernels = true;
  efiInstallAsRemovable = true;
  efiSupport = true;
  fsIdentifier = "uuid";
  splashMode = "stretch";
  version = 2;
  device = "nodev";
  extraEntries = ''
    menuentry "Reboot" {
      reboot
    }
    menuentry "Poweroff" {
      halt
    }
  '';
};
</pre>
</div>

<p>
Of particular importance are the following variables:
</p>

<ul class="org-ul">
<li><code>boot.loader.systemd-boot.enable</code></li>

<li><code>boot.loader.efi.canTouchEfiVariables</code></li>

<li><code>boot.loader.grub.efiInstallAsRemovable</code></li>

<li><code>boot.loader.grub.device</code></li>
</ul>

<p>
Ideally, <code>boot.loader.grub.efiSupport</code> would be sufficient to tell
<a href="https://www.gnu.org/software/grub/">GRUB</a> to install the <a href="https://en.wikipedia.org/wiki/Unified_Extensible_Firmware_Interface">UEFI</a> payload instead.  However, as
it turns out, there is a few more settings required to ensure proper booting in
<a href="https://en.wikipedia.org/wiki/Unified_Extensible_Firmware_Interface">UEFI</a> environments, particularly when using <a href="https://en.wikipedia.org/wiki/RAID">RAID</a>.
</p>

<p>
According to the manual, it's required to set <code>boot.loader.systemd-boot.enable</code>
to <code>true</code>.  Setting <code>boot.loader.grub.device</code> or <code>boot.loader.grub.devices</code> to
anything other than <code>"nodev"</code> or <code>[ "nodev" ]</code> disables
<code>boot.loader.grub.efiSupport</code>.  Moreover, with
<code>boot.loader.efi.canTouchEfiVariables</code>, the installation/build process attempts
to run <code>efibootmgr</code> to modify the NVRAM of the motherboard, setting the boot
targets, this fails when used with <code>boot.loader.grub.device = "nodev"</code>.
Therefore, it is required to set <code>boot.loader.efi.canTouchEfiVariables = false</code>
and <code>boot.loader.grub.efiInstallAsRemovable</code> such that installation process
simply places the <a href="https://www.gnu.org/software/grub/">GRUB</a> <a href="https://en.wikipedia.org/wiki/Unified_Extensible_Firmware_Interface">UEFI</a> payload in the "default"
search location for the motherboard, consulted before the NVRAM settings.
</p>
</div>
</div>

<div id="outline-container-org69804f3" class="outline-4">
<h4 id="org69804f3"><a id="ID-46f99075-4013-4f5d-a991-9b07d3e7e564"></a>Docker, <code>nftables</code>, and NixOS Notes</h4>
<div class="outline-text-4" id="text-org69804f3">
<p>
In developing the system configuration, I came across some issues with respect
to <a href="https://www.docker.com/">Docker</a> and <a href="https://wiki.nftables.org/wiki-nftables/index.php/Main_Page"><code>nftables</code></a>.  The
<a href="https://wiki.nftables.org/wiki-nftables/index.php/Main_Page"><code>nftables</code></a> project became standard in the <a href="https://www.kernel.org/">Linux</a> kernel
in version 3.13 and replaces the myriad of existing <code>{ip,ip6,arp,eb}_tables</code>
tools and (kernel) code.  Specifically, any <a href="https://www.kernel.org/">Linux</a> kernel above 3.13,
<code>iptables</code> and friends are now simply a user-space front-end to the
<a href="https://wiki.nftables.org/wiki-nftables/index.php/Main_Page"><code>nftables</code></a> kernel backend.  However, <a href="https://www.docker.com/">Docker</a> still
does not support <a href="https://wiki.nftables.org/wiki-nftables/index.php/Main_Page"><code>nftables</code></a> directly; there's an
<a href="https://github.com/moby/moby/issues/26824">issue</a> from 2016.
</p>

<p>
With some <a href="https://stephank.nl/p/2017-06-05-ipv6-on-production-docker.html">digging</a> and
<a href="https://fralef.me/docker-and-iptables.html">work</a>, there's a way to get <a href="https://wiki.nftables.org/wiki-nftables/index.php/Main_Page"><code>nftables</code></a>
and <a href="https://www.docker.com/">Docker</a> to work nicely with each other.
</p>

<p>
Specifically, we configure <a href="https://www.docker.com/">Docker</a> to not modify the <code>iptables</code>
rules using the <code>--iptables=false</code> configuration flag for the daemon.  In this
configuration, we can tightly control the firewall with whatever tool we wish,
in this case, <a href="https://wiki.nftables.org/wiki-nftables/index.php/Main_Page"><code>nftables</code></a>.  This comes with the added benefit of
bound ports are not automatically opened to the world.
</p>

<p>
However, when using <a href="https://nixos.org/">NixOS</a>, any modification to the
<a href="https://wiki.nftables.org/wiki-nftables/index.php/Main_Page"><code>nftables</code></a> ruleset will require a reload.  However, with
<a href="https://www.docker.com/">Docker</a> loaded as well, this reload process can actually bring down
the firewall completely since <a href="https://www.docker.com/">Docker</a> (even with <code>--iptables=false</code>)
will attempt to load the <code>iptables</code> kernel module, blocking the resulting
<code>nftables</code> module load.  When using a system such as <a href="https://gentoo.org/">Gentoo</a> this
was never an issue, since the configuration completely ignore the <code>iptables</code>
subsystem (since it was compiled out).  In <a href="https://nixos.org/">NixOS</a>, there's a bit more
dance involved for the time being.
</p>

<p>
This is really a minor annoyance as the firewall rules are only seldom changed.
</p>
</div>
</div>
</div>
</div>
</div>
<footer id="" class="status">
<footer>
  <p>&copy; 2014-2022 Kenny Ballou.
    <a href="http://creativecommons.org/licenses/by-nc-sa/4.0/">Some rights
      reserved.</a></p>
  <p>Powered by <a href="https://gnu.org">GNU/Linux</a></p>
</footer>
</footer>
</body>
</html>
